#### Terraform Plan 📖
**Environment:** `dev`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg]
module.container_environment.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.OperationalInsights/workspaces/flowpost-dev-env-logs]
module.container_registry.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.ContainerRegistry/registries/flowpostdevacr]
module.container_environment.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.App/managedEnvironments/flowpost-dev-env]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.container_environment.azurerm_container_app_environment.this has been deleted
  - resource "azurerm_container_app_environment" "this" {
      - default_domain                 = "thankfulpond-75251bcf.eastus.azurecontainerapps.io" -> null
      - id                             = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.App/managedEnvironments/flowpost-dev-env" -> null
      - name                           = "flowpost-dev-env" -> null
        tags                           = {
            "CostCenter"  = "development"
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "flowpost"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg" -> (known after apply)
      ~ location = "eastus" -> "eastus2" # forces replacement
        name     = "flowpost-dev-rg"
      ~ tags     = {
          + "AutoDeploy"  = "true"
            "CostCenter"  = "development"
          + "Criticality" = "low"
            "Environment" = "dev"
          + "Lifecycle"   = "development"
            "ManagedBy"   = "terraform"
            "Project"     = "flowpost"
        }
    }

  # module.container_environment.azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus2"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "flowpost-dev-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "flowpost-dev-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + zone_redundancy_enabled          = false
    }

  # module.container_environment.azurerm_log_analytics_workspace.this must be replaced
-/+ resource "azurerm_log_analytics_workspace" "this" {
      - cmk_for_query_forced                    = false -> null
      ~ id                                      = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.OperationalInsights/workspaces/flowpost-dev-env-logs" -> (known after apply)
      - immediate_data_purge_on_30_days_enabled = false -> null
      ~ location                                = "eastus" -> "eastus2" # forces replacement
        name                                    = "flowpost-dev-env-logs"
      ~ primary_shared_key                      = (sensitive value)
      ~ secondary_shared_key                    = (sensitive value)
      ~ tags                                    = {
          + "AutoDeploy"  = "true"
            "CostCenter"  = "development"
          + "Criticality" = "low"
            "Environment" = "dev"
          + "Lifecycle"   = "development"
            "ManagedBy"   = "terraform"
            "Project"     = "flowpost"
        }
      ~ workspace_id                            = "1f68e23b-c872-4e3e-8cd2-26688b7bd08d" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.container_environment.time_sleep.wait_for_log_analytics will be created
  + resource "time_sleep" "wait_for_log_analytics" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.container_registry.azurerm_container_registry.this must be replaced
-/+ resource "azurerm_container_registry" "this" {
      ~ admin_password                = (sensitive value)
      ~ admin_username                = "flowpostdevacr" -> (known after apply)
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      ~ encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/1deffe1f-43be-4791-bf95-5c40e473e997/resourceGroups/flowpost-dev-rg/providers/Microsoft.ContainerRegistry/registries/flowpostdevacr" -> (known after apply)
      ~ location                      = "eastus" -> "eastus2" # forces replacement
      ~ login_server                  = "flowpostdevacr.azurecr.io" -> (known after apply)
        name                          = "flowpostdevacr"
      ~ network_rule_set              = [] -> (known after apply)
      - quarantine_policy_enabled     = false -> null
      ~ retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> (known after apply)
      ~ tags                          = {
          + "AutoDeploy"  = "true"
            "CostCenter"  = "development"
          + "Criticality" = "low"
            "Environment" = "dev"
          + "Lifecycle"   = "development"
            "ManagedBy"   = "terraform"
            "Project"     = "flowpost"
        }
      ~ trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.key_vault[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = false
      + enabled_for_disk_encryption   = false
      + id                            = (known after apply)
      + location                      = "eastus2"
      + name                          = "flowpostdevkv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "flowpost-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + tenant_id                     = (known after apply)
      + vault_uri                     = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_access_policy.terraform[0] will be created
  + resource "azurerm_key_vault_access_policy" "terraform" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Create",
          + "Delete",
          + "Get",
          + "List",
          + "Update",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.admin_user_ids[0] will be created
  + resource "azurerm_key_vault_secret" "admin_user_ids" {
      + content_type            = "Admin User IDs (comma-separated)"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "admin-user-ids"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.clerk_publishable_key[0] will be created
  + resource "azurerm_key_vault_secret" "clerk_publishable_key" {
      + content_type            = "Clerk Publishable Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "clerk-publishable-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.clerk_secret_key[0] will be created
  + resource "azurerm_key_vault_secret" "clerk_secret_key" {
      + content_type            = "Clerk Secret Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "clerk-secret-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.firecrawl_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "firecrawl_api_key" {
      + content_type            = "FireCrawl API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "firecrawl-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.gemini_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "gemini_api_key" {
      + content_type            = "Google Gemini API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "gemini-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.openai_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "openai_api_key" {
      + content_type            = "OpenAI API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "openai-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.perplexity_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "perplexity_api_key" {
      + content_type            = "Perplexity API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "perplexity-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.serper_api_key[0] will be created
  + resource "azurerm_key_vault_secret" "serper_api_key" {
      + content_type            = "Serper API Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "serper-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.stripe_secret_key[0] will be created
  + resource "azurerm_key_vault_secret" "stripe_secret_key" {
      + content_type            = "Stripe Secret Key"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "stripe-secret-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault[0].azurerm_key_vault_secret.stripe_webhook_secret[0] will be created
  + resource "azurerm_key_vault_secret" "stripe_webhook_secret" {
      + content_type            = "Stripe Webhook Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "stripe-webhook-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "eastus2"
      + name                          = "flowpost-dev-postgres"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "flowpost-dev-rg"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P10"
      + tags                          = {
          + "AutoDeploy"  = "true"
          + "CostCenter"  = "development"
          + "Criticality" = "low"
          + "Environment" = "dev"
          + "Lifecycle"   = "development"
          + "ManagedBy"   = "terraform"
          + "Project"     = "flowpost"
        }
      + version                       = "16"
      + zone                          = "1"

      + authentication {
          + active_directory_auth_enabled = false
          + password_auth_enabled         = true
        }
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.connection_throttling will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "connection_throttling" {
      + id        = (known after apply)
      + name      = "connection_throttle.enable"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.extensions will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "PGCRYPTO,UUID-OSSP"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.log_checkpoints will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "log_checkpoints" {
      + id        = (known after apply)
      + name      = "log_checkpoints"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.this will be created
  + resource "azurerm_postgresql_flexible_server_database" "this" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "flowpost_dev_db"
      + server_id = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.azure_services[0] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

Plan: 23 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ container_registry_login_server = "flowpostdevacr.azurecr.io" -> (known after apply)
  + key_vault_name                  = "flowpostdevkv"
  + key_vault_secret_names          = {
      + acr_password       = "acr-password"
      + admin_user_ids     = "admin-user-ids"
      + clerk_publishable  = "clerk-publishable-key"
      + clerk_secret       = "clerk-secret-key"
      + database_uri       = "database-uri"
      + firecrawl_api_key  = "firecrawl-api-key"
      + gemini_api_key     = "gemini-api-key"
      + langchain_api_key  = "langchain-api-key"
      + openai_api_key     = "openai-api-key"
      + perplexity_api_key = "perplexity-api-key"
      + postgres_admin     = "postgres-admin"
      + postgres_host      = "postgres-host"
      + postgres_password  = "postgres-password"
      + serper_api_key     = "serper-api-key"
      + stripe_secret      = "stripe-secret-key"
      + stripe_webhook     = "stripe-webhook-secret"
    }
  + key_vault_uri                   = (known after apply)
  + postgresql_connection_info      = (sensitive value)
  + postgresql_database_name        = "flowpost_dev_db"
  + postgresql_server_fqdn          = (known after apply)
  + postgresql_server_name          = "flowpost-dev-postgres"
  + shared_environment              = "dev"

```

</details>

*Pushed by: @Abby263, Action: `pull_request`*